atc1441/ATC_stc_solder_iron/src/STC8xxxx_SDCC.h
#define	MainFosc_IRC24M()	CKSEL = (CKSEL & ~0x03)			/* 选择内部24MHZ时钟 */
#define	MainFosc_XTAL()		CKSEL = (CKSEL & ~0x03) | 0x01	/* 选择外部晶振或时钟 */
#define	MainFosc_IRC32K()	CKSEL =  CKSEL | 0x03			/* 选择内部32K时钟 */
#define	EXT_CLOCK()			XOSCCR = 0x80					/* 选择外部时钟 */
#define	EXT_CRYSTAL()		XOSCCR = 0xC0					/* 选择外部晶振 */


#define	P0PU		(*(__xdata unsigned char volatile *)0xfe10)	/* P0 4.1K Pull Up Enable  */
#define	P1PU		(*(__xdata unsigned char volatile *)0xfe11)	/* P1 4.1K Pull Up Enable  */
#define	P2PU		(*(__xdata unsigned char volatile *)0xfe12)	/* P2 4.1K Pull Up Enable  */
#define	P3PU		(*(__xdata unsigned char volatile *)0xfe13)	/* P3 4.1K Pull Up Enable  */
#define	P4PU		(*(__xdata unsigned char volatile *)0xfe14)	/* P4 4.1K Pull Up Enable  */
#define	P5PU		(*(__xdata unsigned char volatile *)0xfe15)	/* P5 4.1K Pull Up Enable  */
#define	P6PU		(*(__xdata unsigned char volatile *)0xfe16)	/* P6 4.1K Pull Up Enable  */
#define	P7PU		(*(__xdata unsigned char volatile *)0xfe17)	/* P7 4.1K Pull Up Enable  */

#define	P0NCS		(*(__xdata unsigned char volatile *)0xfe18)	/* P0 Non Schmit Trigger  0: 使能端口施密特触发功能(默认), 1: 禁止  */
#define	P1NCS		(*(__xdata unsigned char volatile *)0xfe19)	/* P1 Non Schmit Trigger  */
#define	P2NCS		(*(__xdata unsigned char volatile *)0xfe1a)	/* P2 Non Schmit Trigger  */
#define	P3NCS		(*(__xdata unsigned char volatile *)0xfe1b)	/* P3 Non Schmit Trigger  */
#define	P4NCS		(*(__xdata unsigned char volatile *)0xfe1c)	/* P4 Non Schmit Trigger  */
#define	P5NCS		(*(__xdata unsigned char volatile *)0xfe1d)	/* P5 Non Schmit Trigger  */
#define	P6NCS		(*(__xdata unsigned char volatile *)0xfe1e)	/* P6 Non Schmit Trigger  */
#define	P7NCS		(*(__xdata unsigned char volatile *)0xfe1f)	/* P7 Non Schmit Trigger  */

#define P0SR    (*(__xdata unsigned char volatile *)0xfe20) /* 端口电平转换速度  0: 快, 1: 慢(默认)  */
#define P1SR    (*(__xdata unsigned char volatile *)0xfe21)
#define P2SR    (*(__xdata unsigned char volatile *)0xfe22)
#define P3SR    (*(__xdata unsigned char volatile *)0xfe23)
#define P4SR    (*(__xdata unsigned char volatile *)0xfe24)
#define P5SR    (*(__xdata unsigned char volatile *)0xfe25)
#define P6SR    (*(__xdata unsigned char volatile *)0xfe26)
#define P7SR    (*(__xdata unsigned char volatile *)0xfe27)

#define P0DR    (*(__xdata unsigned char volatile *)0xfe28) /* 端口驱动电流控制  0: 增强驱动能力, 1: 一般驱动能力(默认)  */
#define P1DR    (*(__xdata unsigned char volatile *)0xfe29)
#define P2DR    (*(__xdata unsigned char volatile *)0xfe2a)
#define P3DR    (*(__xdata unsigned char volatile *)0xfe2b)
#define P4DR    (*(__xdata unsigned char volatile *)0xfe2c)
#define P5DR    (*(__xdata unsigned char volatile *)0xfe2d)
#define P6DR    (*(__xdata unsigned char volatile *)0xfe2e)
#define P7DR    (*(__xdata unsigned char volatile *)0xfe2f)

#define P0IE    (*(__xdata unsigned char volatile *)0xfe30)/* 端口数字信号输入使能  0: 禁止数字信号输入, 1: 使能数字信号输入(默认)  */
#define P1IE    (*(__xdata unsigned char volatile *)0xfe31)
#define P2IE    (*(__xdata unsigned char volatile *)0xfe32)
#define P3IE    (*(__xdata unsigned char volatile *)0xfe33)
#define P4IE    (*(__xdata unsigned char volatile *)0xfe34)
#define P5IE    (*(__xdata unsigned char volatile *)0xfe35)
#define P6IE    (*(__xdata unsigned char volatile *)0xfe36)
#define P7IE    (*(__xdata unsigned char volatile *)0xfe37)

#define	I2CCFG		(*(__xdata unsigned char volatile *)0xfe80)	/*   */
#define	I2CMSCR		(*(__xdata unsigned char volatile *)0xfe81)	/*   */
#define	I2CMSST		(*(__xdata unsigned char volatile *)0xfe82)	/*   */
#define	I2CSLCR		(*(__xdata unsigned char volatile *)0xfe83)	/*   */
#define	I2CSLST		(*(__xdata unsigned char volatile *)0xfe84)	/*   */
#define	I2CSLADR	(*(__xdata unsigned char volatile *)0xfe85)	/*   */
#define	I2CTXD		(*(__xdata unsigned char volatile *)0xfe86)	/*   */
#define	I2CRXD		(*(__xdata unsigned char volatile *)0xfe87)	/*   */
#define I2CMSAUX  (*(__xdata unsigned char volatile *)0xfe88)

#define TM2PS     (*(__xdata unsigned char volatile *)0xfea2)
#define TM3PS     (*(__xdata unsigned char volatile *)0xfea3)
#define TM4PS     (*(__xdata unsigned char volatile *)0xfea4)
#define ADCTIM    (*(__xdata unsigned char volatile *)0xfea8)
#define T3T4PIN   (*(__xdata unsigned char volatile *)0xfeac)

#define PWMA_ETRPS (*(__xdata unsigned char volatile *)0xfeb0)
#define PWMA_ENO   (*(__xdata unsigned char volatile *)0xfeb1)
#define PWMA_PS    (*(__xdata unsigned char volatile *)0xfeb2)
#define PWMA_IOAUX (*(__xdata unsigned char volatile *)0xfeb3)
#define PWMB_ETRPS (*(__xdata unsigned char volatile *)0xfeb4)
#define PWMB_ENO   (*(__xdata unsigned char volatile *)0xfeb5)
#define PWMB_PS    (*(__xdata unsigned char volatile *)0xfeb6)
#define PWMB_IOAUX (*(__xdata unsigned char volatile *)0xfeb7)
#define PWMA_CR1   (*(__xdata unsigned char volatile *)0xfec0)
#define PWMA_CR2   (*(__xdata unsigned char volatile *)0xfec1)
#define PWMA_SMCR  (*(__xdata unsigned char volatile *)0xfec2)
#define PWMA_ETR   (*(__xdata unsigned char volatile *)0xfec3)
#define PWMA_IER   (*(__xdata unsigned char volatile *)0xfec4)
#define PWMA_SR1   (*(__xdata unsigned char volatile *)0xfec5)
#define PWMA_SR2   (*(__xdata unsigned char volatile *)0xfec6)
#define PWMA_EGR   (*(__xdata unsigned char volatile *)0xfec7)
#define PWMA_CCMR1 (*(__xdata unsigned char volatile *)0xfec8)
#define PWMA_CCMR2 (*(__xdata unsigned char volatile *)0xfec9)
#define PWMA_CCMR3 (*(__xdata unsigned char volatile *)0xfeca)
#define PWMA_CCMR4 (*(__xdata unsigned char volatile *)0xfecb)
#define PWMA_CCER1 (*(__xdata unsigned char volatile *)0xfecc)
#define PWMA_CCER2 (*(__xdata unsigned char volatile *)0xfecd)
#define PWMA_CNTR  (*(__xdata unsigned int volatile *)0xfece)
#define PWMA_CNTRH (*(__xdata unsigned char volatile *)0xfece)
#define PWMA_CNTRL (*(__xdata unsigned char volatile *)0xfecf)
#define PWMA_PSCR  (*(__xdata unsigned int volatile *)0xfed0)
#define PWMA_PSCRH (*(__xdata unsigned char volatile *)0xfed0)
#define PWMA_PSCRL (*(__xdata unsigned char volatile *)0xfed1)
#define PWMA_ARR   (*(__xdata unsigned int volatile *)0xfed2)
#define PWMA_ARRH  (*(__xdata unsigned char volatile *)0xfed2)
#define PWMA_ARRL  (*(__xdata unsigned char volatile *)0xfed3)
#define PWMA_RCR   (*(__xdata unsigned char volatile *)0xfed4)
#define PWMA_CCR1  (*(__xdata unsigned int volatile *)0xfed5)
#define PWMA_CCR1H (*(__xdata unsigned char volatile *)0xfed5)
#define PWMA_CCR1L (*(__xdata unsigned char volatile *)0xfed6)
#define PWMA_CCR2  (*(__xdata unsigned int volatile *)0xfed7)
#define PWMA_CCR2H (*(__xdata unsigned char volatile *)0xfed7)
#define PWMA_CCR2L (*(__xdata unsigned char volatile *)0xfed8)
#define PWMA_CCR3  (*(__xdata unsigned int volatile *)0xfed9)
#define PWMA_CCR3H (*(__xdata unsigned char volatile *)0xfed9)
#define PWMA_CCR3L (*(__xdata unsigned char volatile *)0xfeda)
#define PWMA_CCR4  (*(__xdata unsigned int volatile *)0xfedb)
#define PWMA_CCR4H (*(__xdata unsigned char volatile *)0xfedb)
#define PWMA_CCR4L (*(__xdata unsigned char volatile *)0xfedc)
#define PWMA_BRK   (*(__xdata unsigned char volatile *)0xfedd)
#define PWMA_DTR   (*(__xdata unsigned char volatile *)0xfede)
#define PWMA_OISR  (*(__xdata unsigned char volatile *)0xfedf)

