atc1441/ATC_stc_solder_iron/src/STC8xxxx_SDCC.h
#define     PWM3C       (*(__xdata unsigned int volatile *)0xfc00)
#define     PWM3CH      (*(__xdata unsigned char volatile *)0xfc00)
#define     PWM3CL      (*(__xdata unsigned char volatile *)0xfc01)
#define     PWM3CKS     (*(__xdata unsigned char volatile *)0xfc02)
#define     PWM3IF      (*(__xdata unsigned char volatile *)0xfc05)
#define     PWM3FDCR    (*(__xdata unsigned char volatile *)0xfc06)
#define     PWM30T1     (*(__xdata unsigned int volatile *)0xfc10)
#define     PWM30T1H    (*(__xdata unsigned char volatile *)0xfc10)
#define     PWM30T1L    (*(__xdata unsigned char volatile *)0xfc11)
#define     PWM30T2     (*(__xdata unsigned int volatile *)0xfc12)
#define     PWM30T2H    (*(__xdata unsigned char volatile *)0xfc12)
#define     PWM30T2L    (*(__xdata unsigned char volatile *)0xfc13)
#define     PWM30CR     (*(__xdata unsigned char volatile *)0xfc14)
#define     PWM30HLD    (*(__xdata unsigned char volatile *)0xfc15)
#define     PWM31T1     (*(__xdata unsigned int volatile *)0xfc18)
#define     PWM31T1H    (*(__xdata unsigned char volatile *)0xfc18)
#define     PWM31T1L    (*(__xdata unsigned char volatile *)0xfc19)
#define     PWM31T2     (*(__xdata unsigned int volatile *)0xfc1a)
#define     PWM31T2H    (*(__xdata unsigned char volatile *)0xfc1a)
#define     PWM31T2L    (*(__xdata unsigned char volatile *)0xfc1b)
#define     PWM31CR     (*(__xdata unsigned char volatile *)0xfc1c)
#define     PWM31HLD    (*(__xdata unsigned char volatile *)0xfc1d)
#define     PWM32T1     (*(__xdata unsigned int volatile *)0xfc20)
#define     PWM32T1H    (*(__xdata unsigned char volatile *)0xfc20)
#define     PWM32T1L    (*(__xdata unsigned char volatile *)0xfc21)
#define     PWM32T2     (*(__xdata unsigned int volatile *)0xfc22)
#define     PWM32T2H    (*(__xdata unsigned char volatile *)0xfc22)
#define     PWM32T2L    (*(__xdata unsigned char volatile *)0xfc23)
#define     PWM32CR     (*(__xdata unsigned char volatile *)0xfc24)
#define     PWM32HLD    (*(__xdata unsigned char volatile *)0xfc25)
#define     PWM33T1     (*(__xdata unsigned int volatile *)0xfc28)
#define     PWM33T1H    (*(__xdata unsigned char volatile *)0xfc28)
#define     PWM33T1L    (*(__xdata unsigned char volatile *)0xfc29)
#define     PWM33T2     (*(__xdata unsigned int volatile *)0xfc2a)
#define     PWM33T2H    (*(__xdata unsigned char volatile *)0xfc2a)
#define     PWM33T2L    (*(__xdata unsigned char volatile *)0xfc2b)
#define     PWM33CR     (*(__xdata unsigned char volatile *)0xfc2c)
#define     PWM33HLD    (*(__xdata unsigned char volatile *)0xfc2d)
#define     PWM34T1     (*(__xdata unsigned int volatile *)0xfc30)
#define     PWM34T1H    (*(__xdata unsigned char volatile *)0xfc30)
#define     PWM34T1L    (*(__xdata unsigned char volatile *)0xfc31)
#define     PWM34T2     (*(__xdata unsigned int volatile *)0xfc32)
#define     PWM34T2H    (*(__xdata unsigned char volatile *)0xfc32)
#define     PWM34T2L    (*(__xdata unsigned char volatile *)0xfc33)
#define     PWM34CR     (*(__xdata unsigned char volatile *)0xfc34)
#define     PWM34HLD    (*(__xdata unsigned char volatile *)0xfc35)
#define     PWM35T1     (*(__xdata unsigned int volatile *)0xfc38)
#define     PWM35T1H    (*(__xdata unsigned char volatile *)0xfc38)
#define     PWM35T1L    (*(__xdata unsigned char volatile *)0xfc39)
#define     PWM35T2     (*(__xdata unsigned int volatile *)0xfc3a)
#define     PWM35T2H    (*(__xdata unsigned char volatile *)0xfc3a)
#define     PWM35T2L    (*(__xdata unsigned char volatile *)0xfc3b)
#define     PWM35CR     (*(__xdata unsigned char volatile *)0xfc3c)
#define     PWM35HLD    (*(__xdata unsigned char volatile *)0xfc3d)
#define     PWM36T1     (*(__xdata unsigned int volatile *)0xfc40)
#define     PWM36T1H    (*(__xdata unsigned char volatile *)0xfc40)
#define     PWM36T1L    (*(__xdata unsigned char volatile *)0xfc41)
#define     PWM36T2     (*(__xdata unsigned int volatile *)0xfc42)
#define     PWM36T2H    (*(__xdata unsigned char volatile *)0xfc42)
#define     PWM36T2L    (*(__xdata unsigned char volatile *)0xfc43)
#define     PWM36CR     (*(__xdata unsigned char volatile *)0xfc44)
#define     PWM36HLD    (*(__xdata unsigned char volatile *)0xfc45)
#define     PWM37T1     (*(__xdata unsigned int volatile *)0xfc48)
#define     PWM37T1H    (*(__xdata unsigned char volatile *)0xfc48)
#define     PWM37T1L    (*(__xdata unsigned char volatile *)0xfc49)
#define     PWM37T2     (*(__xdata unsigned int volatile *)0xfc4a)
#define     PWM37T2H    (*(__xdata unsigned char volatile *)0xfc4a)
#define     PWM37T2L    (*(__xdata unsigned char volatile *)0xfc4b)
#define     PWM37CR     (*(__xdata unsigned char volatile *)0xfc4c)
#define     PWM37HLD    (*(__xdata unsigned char volatile *)0xfc4d)
#define     PWM4C       (*(__xdata unsigned int volatile *)0xfc50)
#define     PWM4CH      (*(__xdata unsigned char volatile *)0xfc50)
#define     PWM4CL      (*(__xdata unsigned char volatile *)0xfc51)
#define     PWM4CKS     (*(__xdata unsigned char volatile *)0xfc52)
#define     PWM4TADC    (*(__xdata unsigned int volatile *)0xfc53)
#define     PWM4TADCH   (*(__xdata unsigned char volatile *)0xfc53)
#define     PWM4TADCL   (*(__xdata unsigned char volatile *)0xfc54)
#define     PWM4IF      (*(__xdata unsigned char volatile *)0xfc55)
#define     PWM4FDCR    (*(__xdata unsigned char volatile *)0xfc56)
#define     PWM40T1     (*(__xdata unsigned int volatile *)0xfc60)
#define     PWM40T1H    (*(__xdata unsigned char volatile *)0xfc60)
#define     PWM40T1L    (*(__xdata unsigned char volatile *)0xfc61)
#define     PWM40T2     (*(__xdata unsigned int volatile *)0xfc62)
#define     PWM40T2H    (*(__xdata unsigned char volatile *)0xfc62)
#define     PWM40T2L    (*(__xdata unsigned char volatile *)0xfc63)
#define     PWM40CR     (*(__xdata unsigned char volatile *)0xfc64)
#define     PWM40HLD    (*(__xdata unsigned char volatile *)0xfc65)
#define     PWM41T1     (*(__xdata unsigned int volatile *)0xfc68)
#define     PWM41T1H    (*(__xdata unsigned char volatile *)0xfc68)
#define     PWM41T1L    (*(__xdata unsigned char volatile *)0xfc69)
#define     PWM41T2     (*(__xdata unsigned int volatile *)0xfc6a)
#define     PWM41T2H    (*(__xdata unsigned char volatile *)0xfc6a)
#define     PWM41T2L    (*(__xdata unsigned char volatile *)0xfc6b)
#define     PWM41CR     (*(__xdata unsigned char volatile *)0xfc6c)
#define     PWM41HLD    (*(__xdata unsigned char volatile *)0xfc6d)
#define     PWM42T1     (*(__xdata unsigned int volatile *)0xfc70)
#define     PWM42T1H    (*(__xdata unsigned char volatile *)0xfc70)
#define     PWM42T1L    (*(__xdata unsigned char volatile *)0xfc71)
#define     PWM42T2     (*(__xdata unsigned int volatile *)0xfc72)
#define     PWM42T2H    (*(__xdata unsigned char volatile *)0xfc72)
#define     PWM42T2L    (*(__xdata unsigned char volatile *)0xfc73)
#define     PWM42CR     (*(__xdata unsigned char volatile *)0xfc74)
#define     PWM42HLD    (*(__xdata unsigned char volatile *)0xfc75)
#define     PWM43T1     (*(__xdata unsigned int volatile *)0xfc78)
#define     PWM43T1H    (*(__xdata unsigned char volatile *)0xfc78)
#define     PWM43T1L    (*(__xdata unsigned char volatile *)0xfc79)
#define     PWM43T2     (*(__xdata unsigned int volatile *)0xfc7a)
#define     PWM43T2H    (*(__xdata unsigned char volatile *)0xfc7a)
#define     PWM43T2L    (*(__xdata unsigned char volatile *)0xfc7b)
#define     PWM43CR     (*(__xdata unsigned char volatile *)0xfc7c)
#define     PWM43HLD    (*(__xdata unsigned char volatile *)0xfc7d)
#define     PWM44T1     (*(__xdata unsigned int volatile *)0xfc80)
#define     PWM44T1H    (*(__xdata unsigned char volatile *)0xfc80)
#define     PWM44T1L    (*(__xdata unsigned char volatile *)0xfc81)
#define     PWM44T2     (*(__xdata unsigned int volatile *)0xfc82)
#define     PWM44T2H    (*(__xdata unsigned char volatile *)0xfc82)
#define     PWM44T2L    (*(__xdata unsigned char volatile *)0xfc83)
#define     PWM44CR     (*(__xdata unsigned char volatile *)0xfc84)
#define     PWM44HLD    (*(__xdata unsigned char volatile *)0xfc85)
#define     PWM45T1     (*(__xdata unsigned int volatile *)0xfc88)
#define     PWM45T1H    (*(__xdata unsigned char volatile *)0xfc88)
#define     PWM45T1L    (*(__xdata unsigned char volatile *)0xfc89)
#define     PWM45T2     (*(__xdata unsigned int volatile *)0xfc8a)
#define     PWM45T2H    (*(__xdata unsigned char volatile *)0xfc8a)
#define     PWM45T2L    (*(__xdata unsigned char volatile *)0xfc8b)
#define     PWM45CR     (*(__xdata unsigned char volatile *)0xfc8c)
#define     PWM45HLD    (*(__xdata unsigned char volatile *)0xfc8d)
#define     PWM46T1     (*(__xdata unsigned int volatile *)0xfc90)
#define     PWM46T1H    (*(__xdata unsigned char volatile *)0xfc90)
#define     PWM46T1L    (*(__xdata unsigned char volatile *)0xfc91)
#define     PWM46T2     (*(__xdata unsigned int volatile *)0xfc92)
#define     PWM46T2H    (*(__xdata unsigned char volatile *)0xfc92)
#define     PWM46T2L    (*(__xdata unsigned char volatile *)0xfc93)
#define     PWM46CR     (*(__xdata unsigned char volatile *)0xfc94)
#define     PWM46HLD    (*(__xdata unsigned char volatile *)0xfc95)
#define     PWM47T1     (*(__xdata unsigned int volatile *)0xfc98)
#define     PWM47T1H    (*(__xdata unsigned char volatile *)0xfc98)
#define     PWM47T1L    (*(__xdata unsigned char volatile *)0xfc99)
#define     PWM47T2     (*(__xdata unsigned int volatile *)0xfc9a)
#define     PWM47T2H    (*(__xdata unsigned char volatile *)0xfc9a)
#define     PWM47T2L    (*(__xdata unsigned char volatile *)0xfc9b)
#define     PWM47CR     (*(__xdata unsigned char volatile *)0xfc9c)
#define     PWM47HLD    (*(__xdata unsigned char volatile *)0xfc9d)
#define     PWM5C       (*(__xdata unsigned int volatile *)0xfca0)
#define     PWM5CH      (*(__xdata unsigned char volatile *)0xfca0)
#define     PWM5CL      (*(__xdata unsigned char volatile *)0xfca1)
#define     PWM5CKS     (*(__xdata unsigned char volatile *)0xfca2)
#define     PWM5IF      (*(__xdata unsigned char volatile *)0xfca5)
#define     PWM5FDCR    (*(__xdata unsigned char volatile *)0xfca6)
#define     PWM50T1     (*(__xdata unsigned int volatile *)0xfcb0)
#define     PWM50T1H    (*(__xdata unsigned char volatile *)0xfcb0)
#define     PWM50T1L    (*(__xdata unsigned char volatile *)0xfcb1)
#define     PWM50T2     (*(__xdata unsigned int volatile *)0xfcb2)
#define     PWM50T2H    (*(__xdata unsigned char volatile *)0xfcb2)
#define     PWM50T2L    (*(__xdata unsigned char volatile *)0xfcb3)
#define     PWM50CR     (*(__xdata unsigned char volatile *)0xfcb4)
#define     PWM50HLD    (*(__xdata unsigned char volatile *)0xfcb5)
#define     PWM51T1     (*(__xdata unsigned int volatile *)0xfcb8)
#define     PWM51T1H    (*(__xdata unsigned char volatile *)0xfcb8)
#define     PWM51T1L    (*(__xdata unsigned char volatile *)0xfcb9)
#define     PWM51T2     (*(__xdata unsigned int volatile *)0xfcba)
#define     PWM51T2H    (*(__xdata unsigned char volatile *)0xfcba)
#define     PWM51T2L    (*(__xdata unsigned char volatile *)0xfcbb)
#define     PWM51CR     (*(__xdata unsigned char volatile *)0xfcbc)
#define     PWM51HLD    (*(__xdata unsigned char volatile *)0xfcbd)
#define     PWM52T1     (*(__xdata unsigned int volatile *)0xfcc0)
#define     PWM52T1H    (*(__xdata unsigned char volatile *)0xfcc0)
#define     PWM52T1L    (*(__xdata unsigned char volatile *)0xfcc1)
#define     PWM52T2     (*(__xdata unsigned int volatile *)0xfcc2)
#define     PWM52T2H    (*(__xdata unsigned char volatile *)0xfcc2)
#define     PWM52T2L    (*(__xdata unsigned char volatile *)0xfcc3)
#define     PWM52CR     (*(__xdata unsigned char volatile *)0xfcc4)
#define     PWM52HLD    (*(__xdata unsigned char volatile *)0xfcc5)
#define     PWM53T1     (*(__xdata unsigned int volatile *)0xfcc8)
#define     PWM53T1H    (*(__xdata unsigned char volatile *)0xfcc8)
#define     PWM53T1L    (*(__xdata unsigned char volatile *)0xfcc9)
#define     PWM53T2     (*(__xdata unsigned int volatile *)0xfcca)
#define     PWM53T2H    (*(__xdata unsigned char volatile *)0xfcca)
#define     PWM53T2L    (*(__xdata unsigned char volatile *)0xfccb)
#define     PWM53CR     (*(__xdata unsigned char volatile *)0xfccc)
#define     PWM53HLD    (*(__xdata unsigned char volatile *)0xfccd)
#define     PWM54T1     (*(__xdata unsigned int volatile *)0xfcd0)
#define     PWM54T1H    (*(__xdata unsigned char volatile *)0xfcd0)
#define     PWM54T1L    (*(__xdata unsigned char volatile *)0xfcd1)
#define     PWM54T2     (*(__xdata unsigned int volatile *)0xfcd2)
#define     PWM54T2H    (*(__xdata unsigned char volatile *)0xfcd2)
#define     PWM54T2L    (*(__xdata unsigned char volatile *)0xfcd3)
#define     PWM54CR     (*(__xdata unsigned char volatile *)0xfcd4)
#define     PWM54HLD    (*(__xdata unsigned char volatile *)0xfcd5)
#define     PWM55T1     (*(__xdata unsigned int volatile *)0xfcd8)
#define     PWM55T1H    (*(__xdata unsigned char volatile *)0xfcd8)
#define     PWM55T1L    (*(__xdata unsigned char volatile *)0xfcd9)
#define     PWM55T2     (*(__xdata unsigned int volatile *)0xfcda)
#define     PWM55T2H    (*(__xdata unsigned char volatile *)0xfcda)
#define     PWM55T2L    (*(__xdata unsigned char volatile *)0xfcdb)
#define     PWM55CR     (*(__xdata unsigned char volatile *)0xfcdc)
#define     PWM55HLD    (*(__xdata unsigned char volatile *)0xfcdd)
#define     PWM56T1     (*(__xdata unsigned int volatile *)0xfce0)
#define     PWM56T1H    (*(__xdata unsigned char volatile *)0xfce0)
#define     PWM56T1L    (*(__xdata unsigned char volatile *)0xfce1)
#define     PWM56T2     (*(__xdata unsigned int volatile *)0xfce2)
#define     PWM56T2H    (*(__xdata unsigned char volatile *)0xfce2)
#define     PWM56T2L    (*(__xdata unsigned char volatile *)0xfce3)
#define     PWM56CR     (*(__xdata unsigned char volatile *)0xfce4)
#define     PWM56HLD    (*(__xdata unsigned char volatile *)0xfce5)
#define     PWM57T1     (*(__xdata unsigned int volatile *)0xfce8)
#define     PWM57T1H    (*(__xdata unsigned char volatile *)0xfce8)
#define     PWM57T1L    (*(__xdata unsigned char volatile *)0xfce9)
#define     PWM57T2     (*(__xdata unsigned int volatile *)0xfcea)
#define     PWM57T2H    (*(__xdata unsigned char volatile *)0xfcea)
#define     PWM57T2L    (*(__xdata unsigned char volatile *)0xfceb)
#define     PWM57CR     (*(__xdata unsigned char volatile *)0xfcec)
#define     PWM57HLD    (*(__xdata unsigned char volatile *)0xfced)


//						             7      6      5      4      3      2      1      0     Reset Value
//sfr PWMSET = 0xF1H;  ENGLBSET PWMRST ENPWM5 ENPWM4 ENPWM3 ENPWM2 ENPWM1 ENPWM0  0000,0000  /* 增强型PWM全局配置寄存器 */ 
#define PWM15_SET_Uniform()				PWMSET |= 0x80		//1：6组PWM采用统一的设置方式
#define PWM15_SET_Independent()		PWMSET &= ~0x80		//0：6组PWM采用各自独立的设置方式

